commands_templates/CreateActions0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/actionengine/wsdl" xmlns:sch="http://www.onvif.org/ver10/schema">
   <soap:Header/>
   <soap:Body>
      <wsdl:CreateActions>
         <!--1 or more repetitions:-->
         <wsdl:Action Name="?" Type="?">
            <wsdl:Parameters>
               <!--Zero or more repetitions:-->
               <sch:SimpleItem Name="?" Value="?"/>
               <!--Zero or more repetitions:-->
               <sch:ElementItem Name="?">
                  <!--You may enter ANY elements at this point-->
               </sch:ElementItem>
               <!--Optional:-->
               <sch:Extension>
                  <!--You may enter ANY elements at this point-->
               </sch:Extension>
            </wsdl:Parameters>
            <!--You may enter ANY elements at this point-->
         </wsdl:Action>
      </wsdl:CreateActions>
   </soap:Body>
</soap:Envelope>